tests/stress/artillery/config.common.yml
config:
  target: "http://localhost:8080"
  processor: "../src/processor.ts"
  defaults:
    headers:
      Content-Type: "application/json"
  phases: &defaultPhases
    - name: "warmup"
      duration: "{{ $processEnvironment.ARTILLERY_WARMUP_DURATION }}"
      arrivalRate: "{{ $processEnvironment.ARTILLERY_WARMUP_RATE }}"
    - name: "ramp"
      duration: "{{ $processEnvironment.ARTILLERY_RAMP_DURATION }}"
      arrivalRate: "{{ $processEnvironment.ARTILLERY_RAMP_START_RATE }}"
      rampTo: "{{ $processEnvironment.ARTILLERY_RAMP_TO_RATE }}"
    - name: "sustain"
      duration: "{{ $processEnvironment.ARTILLERY_SUSTAIN_DURATION }}"
      arrivalRate: "{{ $processEnvironment.ARTILLERY_SUSTAIN_RATE }}"
    - name: "spike"
      duration: "{{ $processEnvironment.ARTILLERY_SPIKE_DURATION }}"
      arrivalRate: "{{ $processEnvironment.ARTILLERY_SPIKE_RATE }}"
    - name: "cooldown"
      duration: "{{ $processEnvironment.ARTILLERY_COOLDOWN_DURATION }}"
      arrivalRate: "{{ $processEnvironment.ARTILLERY_COOLDOWN_RATE }}"